tap "anomalyco/tap"
tap "dashlane/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
tap "runpod/runpodctl"
tap "sinelaw/fresh"
tap "steipete/tap"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "xz"
brew "tree"
brew "ansible"
brew "automake"
brew "bash"
brew "bat"
brew "icu4c@76"
brew "bfg"
brew "binutils"
brew "bison"
brew "btop"
brew "emacs"
brew "cask"
brew "chezmoi"
brew "chruby"
brew "cmake"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "sdl2"
brew "fish"
brew "freerdp"
brew "fresh-editor"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gdbm"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitlab-runner"
brew "glfw"
brew "gsettings-desktop-schemas"
brew "glow"
brew "go"
brew "pkgconf"
brew "grc"
brew "hicolor-icon-theme"
brew "hashcat"
brew "helix"
brew "hexedit"
brew "httpd"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "john"
brew "jp2a"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libvirt", restart_service: :changed
brew "llvm"
brew "lld"
brew "mas"
brew "mercurial"
brew "ninja"
brew "meson"
brew "mingw-w64"
brew "mysql"
brew "mysql@8.4"
brew "nasm"
brew "neovim"
brew "nim"
brew "nmap"
brew "node"
brew "nvm"
brew "ollama"
brew "openssl@1.1"
brew "openvpn"
brew "p7zip"
brew "perl"
brew "pipes-sh"
brew "pipx", link: false
brew "pngpaste"
brew "pnpm"
brew "postgresql@14"
brew "powerlevel10k"
brew "procs"
brew "proxychains-ng"
brew "pyenv"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.10"
brew "python@3.12"
brew "qemu"
brew "qrencode"
brew "radare2"
brew "ranger"
brew "ripgrep"
brew "rizin"
brew "ruby"
brew "ruby-install"
brew "rust"
brew "sevenzip"
brew "spoof-mac"
brew "stow"
brew "switchaudio-osx"
brew "telnet"
brew "tldr"
brew "tmux"
brew "vim"
brew "virtualenv"
brew "wget"
brew "wireguard-tools"
brew "yara"
brew "yasm"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "dashlane/tap/dashlane-cli"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "runpod/runpodctl/runpodctl"
brew "steipete/tap/gogcli"
brew "steipete/tap/summarize"
cask "nikitabobko/tap/aerospace"
cask "claude-code"
cask "steipete/tap/codexbar"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "gstreamer-runtime"
cask "imhex"
cask "karabiner-elements"
cask "kitty"
cask "obsidian"
cask "orbstack"
cask "rar"
cask "sf-symbols"
cask "vscodium"
cask "warp"
cask "x2goclient"
cask "xquartz"
mas "Dashlane", id: 517914548
mas "Goodnotes", id: 1444383602
mas "Hidden Bar", id: 1452453066
mas "Hotspot Shield", id: 771076721
mas "Microsoft Outlook", id: 985367838
mas "Pieoneer", id: 6739781207
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "darkoperator.aggressorscript"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "rastamouse.crystal-palace"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sst-dev.opencode"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "vadimcn.vscode-lldb"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
go "golang.org/x/tools/gopls"
